
IDENTIFICATION DIVISION.
PROGRAM-ID. CLKMAIN.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-STCK-TOKEN            PIC X(8).
01  WS-YEAR-CHAR             PIC X(4).
01  WS-JDAY-CHAR             PIC X(3).
01  WS-HH-CHAR               PIC X(2).
01  WS-MM-CHAR               PIC X(2).
01  WS-SS-CHAR               PIC X(2).

01  WS-JULIAN-YYYYDDD        PIC X(7).

PROCEDURE DIVISION.
MAIN-LOGIC.
    CALL 'STCKREAD' USING WS-STCK-TOKEN
        ON EXCEPTION
            DISPLAY 'STCKREAD failed'
            STOP RUN
    END-CALL.

    CALL 'STCKPARSE' USING
         WS-STCK-TOKEN
         WS-YEAR-CHAR
         WS-JDAY-CHAR
         WS-HH-CHAR
         WS-MM-CHAR
         WS-SS-CHAR
        ON EXCEPTION
            DISPLAY 'STCKPARSE failed'
            STOP RUN
    END-CALL.

    CALL 'JULIAN7' USING
         WS-YEAR-CHAR
         WS-JDAY-CHAR
         WS-JULIAN-YYYYDDD
    END-CALL.

    DISPLAY 'UTC Time  : ' WS-HH-CHAR ':' WS-MM-CHAR ':' WS-SS-CHAR.
    DISPLAY 'Julian    : ' WS-JULIAN-YYYYDDD.

    GOBACK.
