
IDENTIFICATION DIVISION.
PROGRAM-ID. JULIAN7.
DATA DIVISION.
LINKAGE SECTION.
01  L-YEAR-CHAR  PIC X(4).
01  L-DDD-CHAR   PIC X(3).
01  L-YYYYDDD    PIC X(7).
PROCEDURE DIVISION USING L-YEAR-CHAR L-DDD-CHAR L-YYYYDDD.
    STRING L-YEAR-CHAR L-DDD-CHAR
      DELIMITED BY SIZE
      INTO L-YYYYDDD
    END-STRING
    GOBACK.
