//CUSTINIT JOB (ACCT),'HALDB INIT PARTS',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//PINIT    EXEC PGM=DFSRRC00,REGION=0M,
//         PARM='ULU,DFSUPNT0,CUSTORDP,,,,,,,,,SYSIN,,Y,N'
//STEPLIB  DD  DISP=SHR,DSN=IMS.SDFSRESL
//DFSRESLB DD  DISP=SHR,DSN=IMS.SDFSRESL
//IMS      DD  DISP=SHR,DSN=IMS.DBDLIB
//         DD  DISP=SHR,DSN=IMS.PSBLIB
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSIN    DD  *
PARTA
PARTB
/*
