01  MI-CUST-ID                   PIC X(10).
       01  MI-ITEM-ID                   PIC X(10).
       01  MI-QUANTITY                  PIC 9(5).
       01  MI-ORDER-DATE                PIC X(8).
