TITLE 'Client/Order Mgmt Mapset'
CLMAPS   DFHMSD  TYPE=&&SYSPARM,LANG=COBOL,MODE=INOUT,STORAGE=AUTO,
               TIOAPFX=YES,CTRL=(FREEKB),MAPATTS=(COLOR,HILIGHT),
               DSATTS=(COLOR,HILIGHT)
* -----------------------------------------------------------------
* MENU MAP
* -----------------------------------------------------------------
MENUMAP  DFHMDI  SIZE=(24,80),LINE=1,COLUMN=1,JUSTIFY=LEFT,
               CTRL=(FREEKB,FRSET)
TITL     DFHMDF  POS=(1,2),LENGTH=27,ATTRB=(PROT,BRT),
               INITIAL='Client/Order Management'
OPTIT    DFHMDF  POS=(3,2),LENGTH=40,ATTRB=(PROT,NORM),
               INITIAL='1=Client  2=Order  3=Inquiry  PF3=Exit'
OPT      DFHMDF  POS=(5,2),LENGTH=3,ATTRB=(UNPROT,IC,FSET)
MSG      DFHMDF  POS=(22,2),LENGTH=76,ATTRB=(PROT,NORM)
* -----------------------------------------------------------------
* CLIENT MAP (CRUD)
* -----------------------------------------------------------------
CLIMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
CLIT     DFHMDF POS=(1,2),LENGTH=20,ATTRB=(PROT,BRT),
               INITIAL='Client Maintenance'
CFUNCIT  DFHMDF POS=(3,2),LENGTH=30,ATTRB=(PROT,NORM),
               INITIAL='Action(I/U/D/Q):'
CFUNC    DFHMDF POS=(3,20),LENGTH=1,ATTRB=(UNPROT,IC,FSET)
CIDIT    DFHMDF POS=(5,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Client ID:'
CID      DFHMDF POS=(5,15),LENGTH=10,ATTRB=(UNPROT,FSET)
CNAMEIT  DFHMDF POS=(7,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Name:'
CNAME    DFHMDF POS=(7,15),LENGTH=35,ATTRB=(UNPROT)
CMAILIT  DFHMDF POS=(9,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Email:'
CMAIL    DFHMDF POS=(9,15),LENGTH=40,ATTRB=(UNPROT)
CPHONEIT DFHMDF POS=(11,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Phone:'
CPHONE   DFHMDF POS=(11,15),LENGTH=20,ATTRB=(UNPROT)
CSTATIT  DFHMDF POS=(13,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Status:'
CSTATUS  DFHMDF POS=(13,15),LENGTH=10,ATTRB=(UNPROT)
CMSG     DFHMDF POS=(22,2),LENGTH=76,ATTRB=(PROT,NORM)
* -----------------------------------------------------------------
* ORDER MAP (CRUD)
* -----------------------------------------------------------------
ORDMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
ORDT     DFHMDF POS=(1,2),LENGTH=20,ATTRB=(PROT,BRT),
               INITIAL='Order Maintenance'
OFUNCIT  DFHMDF POS=(3,2),LENGTH=30,ATTRB=(PROT,NORM),
               INITIAL='Action(I/U/D/Q):'
OFUNC    DFHMDF POS=(3,20),LENGTH=1,ATTRB=(UNPROT,IC,FSET)
OIDIT    DFHMDF POS=(5,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Order ID:'
OID      DFHMDF POS=(5,15),LENGTH=12,ATTRB=(UNPROT,FSET)
OCIDIT   DFHMDF POS=(7,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Client ID:'
OCID     DFHMDF POS=(7,15),LENGTH=10,ATTRB=(UNPROT)
ODATEIT  DFHMDF POS=(9,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Order Date:'
ODATE    DFHMDF POS=(9,15),LENGTH=10,ATTRB=(UNPROT)
OSTATIT  DFHMDF POS=(11,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Status:'
OSTATUS  DFHMDF POS=(11,15),LENGTH=12,ATTRB=(UNPROT)
OAMTIT   DFHMDF POS=(13,2),LENGTH=12,ATTRB=(PROT,NORM),
               INITIAL='Amount:'
OAMOUNT  DFHMDF POS=(13,15),LENGTH=12,ATTRB=(UNPROT)
OMSG     DFHMDF POS=(22,2),LENGTH=76,ATTRB=(PROT,NORM)
* -----------------------------------------------------------------
         DFHMSD TYPE=FINAL
         END
