       01  Container-Transfer-Fields.
           05  XFER-Channel-Name             pic x(16).
           05  XFER-Container-Name           pic x(16).
           05  XFER-Container-Data           pic x(5000).
           05  XFER-Container-Data-Length    pic s9(9) binary.