      * Record layout for PHRASES file, used in the Monday's Child example.
           05  day-of-week-code      pic x.
           05  day-phrase            pic x(49).