//SECTRUN  JOB (ACCT),'RUN SECTDRIV',CLASS=A,MSGCLASS=H,
//             NOTIFY=&SYSUID
//STEP1    EXEC PGM=SECTDRIV
//STEPLIB  DD  DSN=&SYSUID..SECTLOAD,DISP=SHR
//SYS010   DD  DISP=SHR,DSN=&SYSUID..SECT.SYS010.INPUT
//SYS011   DD  SYSOUT=*
//SYS020   DD  DISP=SHR,DSN=&SYSUID..SECT.SYS020.CLUSTER
