       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWRLD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO SYS010
               ORGANIZATION IS SEQUENTIAL.
           SELECT OUTFILE ASSIGN TO SYS050
               ORGANIZATION IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  INFILE
           RECORD CONTAINS 80 CHARACTERS.
       01  IN-REC      PIC X(80).
       FD  OUTFILE
           RECORD CONTAINS 80 CHARACTERS.
       01  OUT-REC     PIC X(80).
       WORKING-STORAGE SECTION.
       01 EOF-FLAG PIC X VALUE 'N'.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           OPEN INPUT INFILE OUTPUT OUTFILE
           PERFORM UNTIL EOF-FLAG = 'Y'
               READ INFILE AT END MOVE 'Y' TO EOF-FLAG END-READ
               IF EOF-FLAG NOT = 'Y'
                   MOVE IN-REC TO OUT-REC
                   WRITE OUT-REC
               END-IF
           END-PERFORM
           CLOSE INFILE OUTFILE
           STOP RUN.