//CRTDB   JOB (ACCT),'CREATE DB',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//STEP1   EXEC PGM=IKJEFT01,REGION=0M
//STEPLIB DD  DISP=SHR,DSN=DSNxx.SDSNEXIT
//        DD  DISP=SHR,DSN=DSNxx.SDSNLOAD
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSTSIN  DD *
  DSN SYSTEM(DB2A)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP71) -
      LIB('DSNxx.RUNLIB.LOAD') PARMS('SQL')
  END
/*
//SYSIN    DD  DISP=SHR,DSN=your.db2.ddl(DB2_DDL)
